Revit 2024 API
ScheduleFieldId Properties
The ScheduleFieldId type exposes the following members.
Properties
Name | Description
IntegerValue
 Provides the value of the ScheduleFieldId as an integer.
InvalidScheduleFieldId
 Get the invalid ScheduleFieldId whose IntegerValue is -1.
See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace